#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
azuread_application.ACR-access-app: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec]
azuread_application_password.ACR-access-app-password: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec/password/62233b5d-32c4-4ff6-ba0e-32862777f89c]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-20 14:18:32.739647743 +0000 UTC]
azurerm_key_vault.akv-terraform-secrets: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-terraform-dev-001/providers/Microsoft.KeyVault/vaults/akv-projectf-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application_password.ACR-access-app-password must be replaced
-/+ resource "azuread_application_password" "ACR-access-app-password" {
      ~ display_name          = "GithubActionsAcrAccessSecret" -> "GHActionsAcrAccessSecret" # forces replacement
      ~ id                    = "2e293956-b8a5-4ff5-92e6-2b3c355cbaec/password/62233b5d-32c4-4ff6-ba0e-32862777f89c" -> (known after apply)
      ~ key_id                = "62233b5d-32c4-4ff6-ba0e-32862777f89c" -> (known after apply)
      ~ start_date            = "2022-07-20T12:57:20Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault.akv-terraform-secrets will be updated in-place
  ~ resource "azurerm_key_vault" "akv-terraform-secrets" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                ]
              - object_id               = "a0325f8e-f392-43cb-8928-b99aaaeca828"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "e2584cbb-77a2-443d-b6c7-e3436ddf47eb"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
                secret_permissions      = [
                    "Get",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "e2584cbb-77a2-443d-b6c7-e3436ddf47eb"
            },
        ]
        id                              = "/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-terraform-dev-001/providers/Microsoft.KeyVault/vaults/akv-projectf-dev-001"
        name                            = "akv-projectf-dev-001"
        tags                            = {
            "CreatedBy" = "4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.ACR-access-app-password-akv-secret will be created
  + resource "azurerm_key_vault_secret" "ACR-access-app-password-akv-secret" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-terraform-dev-001/providers/Microsoft.KeyVault/vaults/akv-projectf-dev-001"
      + name           = "GHActionsAcrAccessSecret"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ service-principal-passoword-output = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*